In [31]:
import pandas as pd
import numpy as np

In [6]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [11]:
pd.DataFrame(dict1)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [12]:
d1=pd.DataFrame(dict1)

In [13]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [15]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [17]:
# method-1

In [16]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [18]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [20]:
d1.isnull().sum()*100/len(d1)*100

Names    2500.0
Age      2500.0
City     2500.0
dtype: float64

- np.nan:not a number this applicable for numerical columns only

- generally data has some empty rows

- it is a data problem

- if you read that kind of data you will see Null

- You need to understand it is a data corrupted

**method-1**

- fill with some random values

- method nan.file nan

In [21]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

**method-2**

- we can fill the values w.r.t columns also

In [25]:
d1['Age'].fillna(40)

# it will not updated
# inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [24]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [26]:
d1['Age'].fillna(40,inplace=True)

In [27]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [32]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)

**method-3**

. bfill
. ffill
. pad
. backfill

In [34]:
d1.fillna(method='bfill')
# it will fill with below value or next value
# columns1:names index 3 is missing values it is filled with index 4 values
# columns2:age index 1 is missing values it is filled with index 2 values
# columns3:city index 4 is missing values it is filled with next values

#     but we dont have next value

C:\Users\SIRI\AppData\Local\Temp\ipykernel_10224\686433089.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [35]:
d1.fillna(method='bfill',axis=1)
# axis=1 means

C:\Users\SIRI\AppData\Local\Temp\ipykernel_10224\1719671957.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [36]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [37]:
d1.fillna(method='pad')

C:\Users\SIRI\AppData\Local\Temp\ipykernel_10224\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

- backfill and bill fill with Next value

- pad and ffill fill with previous value

- but it will changed based on axis

**method -4**
- mean
- median
- mode
 - numerical can fill with mean value

 - but mean affect by outliers
- if we dont have outliers it is best one

- median
  - numerical values can fill with medain value
  - we know that medain value doesnot affect with outliers
-  - so if outliers are there we can go with median
- mode
  mode is usefulfor categorical data

In [38]:
dict1={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
d1=pd.DataFrame(dict1)

In [39]:
# we already know we can fill with some values based on specific column using for
# d1.fillna(<random_number>)
# d1 represents all the columns 
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [44]:
age_median=d1['Names'].median()
d1['Names'].fillna(age_median)

TypeError: could not convert string to float: 'Aravind'

In [42]:
age_mode=d1['City'].mode()
d1['City'].fillna(age_mode)

0        Hyd
1        Blr
2    Chennai
3        NaN
Name: City, dtype: object

In [ ]:
- fill with random value

- fill with random value on specifi value

-

**method_5**

**KNN imputer**

- KNN: K nearest Negiboghers

- k is a hyper parameter means users can choose

- it is a distance metric:**Euclidian distances**

- KNN imputer will take the mean of the neighours

- The neighours value can provided by using value = k

- it is under sklearn package

- Under sklearn we have imputer method

- under imputer method we have KNN imouter

- Applicable only for Numerical data

In [ ]:
fr0m sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[[